Repository: quarkslab/tritondse
Catalog: doc/locale/*/LC_MESSAGES/dev_doc/routines.po
Languages: fr

source: Supported Routines
fr: Routines supportées

source: Mark the input seed as OK and stop execution.
fr: Marque la graine d'entrée comme OK et arrête l'exécution.

source: **Description**: The atoi() function converts the initial portion of the string pointed to by nptr to int. The behavior is the same as
fr: **Description**: La fonction ``atoi()`` convertis la string en paramètre en entier. Le comportement est le même que

source: Concrete: /
fr: Concret: /

source: Symbolic: Represent the return value symbolically with 10 nested if to represent the value.
fr: Symbolique: Représente la valeur de retour symboliquement avec 10 if logiques imbriqués pour représenter la valeur.

source: The function does not support all possibles representation of an integer. It does not support negative integer nor values prefixed by spaces.
fr: Cette fonction ne supporte pas toutes les représentation possible d'un entier. Elle ne supporte par exemple pas les entiers négatifs, ni les chaînes préfixées par des espaces.

source: Returns
fr: Renvoi

source: Symbolic value of the integer base on the symbolic string ``nptr``
fr: Valeur symbolique de l'entier issue du traitement de la chaîne ``nptr``

source: The calloc behavior.
fr: Comportement de calloc

source: The clock_gettime behavior.
fr: Comportement de clock_gettime

source: The __errno_location behavior.
fr: Comportement de __errno_location

source: The exit behavior.
fr: Comportement de exit

source: The fclose behavior.
fr: Comportement de fclose

source: The fgets behavior.
fr: Comportement de fgets

source: The fopen behavior.
fr: Comportement de fopen

source: The fprintf behavior.
fr: Comportement de fprintf

source: The fputc behavior.
fr: Comportement de fputc

source: The fputs behavior.
fr: Comportement de fputs

source: The fread behavior.
fr: Comportement de fread

source: The free behavior.
fr: Comportement de free

source: The fwrite behavior.
fr: Comportement de fwrite

source: The gettimeofday behavior.
fr: Comportement de gettimeofday

source: The __libc_start_main behavior.
fr: Comportement de __libc_start_main

source: The malloc behavior.
fr: Comportement de malloc

source: The memcmp behavior.
fr: Comportement de memcmp

source: The memcpy behavior.
fr: Comportement de memcpy

source: The memmem behavior.
fr: Comportement de memmem

source: The memmove behavior.
fr: Comportement de memmove

source: The memset behavior.
fr: Comportement de memset

source: The printf behavior.
fr: Comportement de printf

source: The pthread_create behavior.
fr: Comportement de pthread_create

source: The pthread_exit behavior.
fr: Comportement de pthread_exit

source: The pthread_join behavior.
fr: Comportement de pthread_join

source: The pthread_mutex_destroy behavior.
fr: Comportement de pthread_mutex_destroy

source: The pthread_mutex_init behavior.
fr: Comportement de pthread_mutex_init

source: The pthread_mutex_lock behavior.
fr: Comportement de pthread_mutex_lock

source: The pthread_mutex_unlock behavior.
fr: Comportement de pthread_mutex_unlock

source: The puts behavior.
fr: Comportement de puts

source: The rand behavior.
fr: Comportement de rand

source: The read behavior.
fr: Comportement de read

source: The sem_destroy behavior.
fr: Comportement de sem_destroy

source: The sem_getvalue behavior.
fr: Comportement de sem_getvalue

source: The sem_init behavior.
fr: Comportement de sem_init

source: The sem_post behavior.
fr: Comportement de sem_post

source: The sem_timedwait behavior.
fr: Comportement de sem_timedwait

source: The sem_trywait behavior.
fr: Comportement de sem_trywait

source: The sem_wait behavior.
fr: Comportement de sem_wait

source: The sleep behavior.
fr: Comportement de sleep

source: The sprintf behavior.
fr: Comportement de sprintf

source: The __stack_chk_fail behavior.
fr: Comportement de __stack_chk_fail

source: The strcasecmp behavior.
fr: Comportement de strcasecmp

source: The strchr behavior.
fr: Comportement de strchr

source: The strcmp behavior.
fr: Comportement de strcmp

source: The strcpy behavior.
fr: Comportement de strcpy

source: The strerror behavior.
fr: Comportement de strerror

source: Parameters
fr: Paramètres

source: The current symbolic execution instance
fr: L'instance courrante de l'exécution symbolique

source: The current process state
fr: Le process

source: a concrete value
fr: une valeur concrète

source: The strlen behavior.
fr: Comportement de strlen

source: The strncasecmp behavior.
fr: Comportement de strncasecmp

source: The strncmp behavior.
fr: Comportement de strncmp

source: The strncpy behavior.
fr: Comportement de strncpy

source: The strtok_r behavior.
fr: Comportement de strtok_r

source: The strtoul behavior.
fr: Comportement de strtoul

source: The __xstat behavior.
fr: Comportement de __xstat

source: **tritondse** does not support Windows and thus none of its API functions.
fr: **tritondse** ne supporte pas Windows et donc aucunes de ces fonctions d'API.
