Repository: quarkslab/tritondse
Catalog: doc/locale/*/LC_MESSAGES/dev_doc/seedscheduling.po
Languages: fr

source: Seed Scheduling
fr: Ordonancement des Entrées

source: Seed scheduling algorithm, are classes basically providing the next seed input to execute. They can be given to the :py:obj:`tritondse.seeds_manager.SeedManager` constructor. The scheduling of seeds might be different depending on the need. All strategies should satisfy the interface defined by :py:obj:`tritondse.seeds_manager.SeedManager`.
fr: L'algorithme d'ordonnancement des graines a pour tâche de fournir la prochaine graine à exécuter. La stratégie est fournie au constructeur de :py:obj:`tritondse.seeds_manager.SeedManager`.L'ordonnancement peut être différent en fonction du besoin. Toutes les stratégies doivent satisfaire l'interface définie par: :py:obj:`tritondse.seeds_manager.SeedScheduler`.

source: Abstract class for all seed selection strategies. This class provides the base methods that all subclasses should implement to be compliant with the interface.
fr: Classe abstraite représentant une stratégie d'ordonnancement. Cette classe fournit l'interface à implémenter pour satisfaire l'interface.

source: Add a new seed in the scheduler
fr: Ajoute une nouvelle graine dans l'ordonnanceur.

source: Parameters
fr: Paramètres

source: Seed to add in the scheduler
fr: Graine à ajouter dans l'ordonnanceur.

source: Function called by the seed manager to know if it can start negating branches to discover new paths. Some seed scheduler might want to run concretely all inputs first before starting negating branches.
fr: Fonction appelée par le SeedManager pour savoir s'il peut nier les branches d'un prédicat de chemin. En effet, certains ordonnanceurs peuvent demander à exécuter toutes les entrées une fois avant de commencer à nier des branches.

source: Returns
fr: Renvoie

source: true if the :py:obj:`SeedManager` can negate branches
fr: Vrai si :py:obj:`SeedManager` peut nier les branches

source: Returns true if there are still seeds to be processed in the scheduler
fr: Renvoie vrai s'il y a toujours des graines en attente de traitement

source: true if there are seeds to process
fr: vrai si des graines sont à traiter

source: Return the next seed to execute.
fr: Renvoie la prochaine graine à exécuter

source: seed to execute
fr: graine à exécuter

source: Return type
fr: Type de retour

source: Called at the end of the exploration to perform some clean-up or anything else.
fr: Appelé à la fin de l'exploration pour effectuer du post-traitement ou autre.

source: Call after every execution. That function might help the scheduler with some of its internal states. For instance the scheduler is keep somes seed meant to cover an address which is now covered, it can just drop these seeds.
fr: Appelé après chaque exécution. Cette fonction peut aider l'ordonnanceur à effectuer des opérations sur son état interne. Par exemple, l'ordonnanceur peut conserver des graines qui visent à couvrir des adresses qui après l'exécution sont maintenant couvertes. Celles-ci peuvent donc raisonnablement être jetées.

source: global coverage of the exploration
fr: référence vers la couverture globale de l'exploration

source: Existing strategies
fr: Stratégies existantes

source: Strategy that first execute all seeds without negating branches in order to get the most updated coverage and which then re-run all relevant seeds to negate their branches.
fr: Stratégie qui exécute d'abord toutes les entrées sans nier de branches pour d'abord obtenir la couverture la plus exhaustive du programme. Elle ré-exécute ensuite chaque graines pouvant mettre à jour de la couverture en niant les branches qui le requiert.

source: This worklist works as follow:
fr: Cette worklist fonctionne comme suit:

source: return first fresh seeds first to get them executed (to improve coverage)
fr: renvoie une graine 'fraîche' pour qu'elle soit exécutée *(pour améliorer la couverture)*

source: keep the seed in the worklist up until it gets dropped or thoroughtly processed
fr: garde la graine dans la worklist jusqu'à ce qu'elle soit jetée ou traitée complètement

source: if no fresh seed is available, iterates seed that will generate coverage
fr: si aucunes graine 'fraîche' n'est disponible, commencer à itérer les autres pour générer la nouvelle couverture.

source: Number of pending seeds to execute
fr: Nombre de graines en attente d'être exécutées

source: Add a seed to the worklist
fr: Ajoute une graine dans l'ordonnanceur

source: seed to add to the scheduler
fr: graine à ajouter dans l'ordonnanceur

source: Returns True if there are no "fresh" seeds to execute.
fr: Renvoie vrai s'il n'y a pas de graines "fraîches" à exécuter.

source: True if all fresh seeds have been executed.
fr: Vrai si toutes les graines fraîches ont été exécutées

source: Returns true if there are still seeds in the worklist
fr: Renvoie vrai s'il reste des graines à traiter

source: Return the next seed to execute
fr: Renvoie la prochaine graine à exécuter

source: At the end of the execution, print the worklist to know its state before exit.
fr: À la fin de l'exploration affiche l'état de l'ordonnanceur.

source: Update the coverage state of the worklist with the global one
fr: Met à jour la couverture de l'ordonnanceur avec la couverture globale

source: This worklist classifies seeds by addresses. We map a seed X to an address Y, if the seed X has been generated to reach the address Y. When the method pick() is called, seeds covering a new address 'Y' are selected first. Otherwise anyone is taken.
fr: Cet ordonnanceur classifie les graines par adresses (à couvrir). Il assigne une graine X à une adresse Y, si la graine X a été générée pour atteindre Y. Quand la méthode pick est appelé, les graines couvrant Y sont sélectionnées en premières. Autrement n'importe laquelle est prise.

source: Always true. This strategy always allows solving branches. As a consequence it might try to solve a branch already covered in a seed not run yet. But this enables iterating a seed only once.
fr: Toujours vrai. Cette stratégie autorise toujours à résoudre les conditions de branchement. Une conséquence et qu'elle peut tenter de nier une branche couverte dans une autre graine qui n'a pas encore été exécutée. Par contre, cela permet d'exécuter une graine une seule fois.

source: True
fr: Vrai

source: next seed to execute (first one covering new addresses, otherwise any other)
fr: prochaine graine à exécuter.

source: Update the coverage state of the woklist with the global one
fr: Met à jour la couverture de l'ordonnanceur avec la couverture globale

source: Trivial strategy that returns any Seed without any classification. It uses a Set for insertion and pop (which is random) for picking seeds.
fr: Stratégie triviale qui renvoie n'importe quelle graine sans aucune classification d'aucune sorte. Elle utilise un set et renvoie n'importe qu'elle élément lors d'une pick.

source: Seed to add to this rand scheduler
fr: Graine ajoutée à l'ordonnanceur aléatoire

source: Always true
fr: Toujours vrai

source: Return the next seed to execute. The method pop() removes a random element from the set and returns the removed element. Unlike, a stack a random element is popped off the set.
fr: Renvoie la prochaine graine à exécuter. La méthode pop() renvoie un élément aléatoire de l'ensemble et l'enlève par la même occasion de l'ensemble.

source: next seed to executre
fr: prochaine graine à exécuter
