Repository: quarkslab/tritondse
Catalog: doc/locale/*/LC_MESSAGES/api/configuration.po
Languages: fr

source: Data class holding tritondse configuration parameter
fr: Class de données contenant les paramètres de configuration de tritondse

source: Parameters
fr: Paramètres

source: Enable debugging logging
fr: Active le logging de debug

source: Branch solving strategy to apply for a single execution. For a given non-covered branch allows changing whether we try to solve it at all occurences or more seldomly. default: :py:obj:`BranchCheckStrategy.FIRST_LAST_NOT_COVERED`
fr: Stratégie de résolution des branches lors d'une seule exécution. Pour une branche non-couverte donnée, cela permet de configurer si le moteur essaye de résoudre toutes les occurrences de cette branche ou alors le faire de manière moins récurrente. Valeur par défaut: :py:obj:`BranchCheckStrategy.FIRST_LAST_NOT_COVERED`

source: Coverage strategy to apply for the whole exploration, default: :py:obj:`CoverageStrategy.CODE_COVERAGE`
fr: Stratégie de couverture à appliquer pour toute l'exploration. Valeur par défaut: :py:obj:`CoverageStrategy.CODE_COVERAGE`

source: Enable debug logging or not. Value taken from constructor. FIXME: What if the value is changed during execution ?
fr: Active le logging de debug ou non. La valeur est récupérée du constructeur.

source: Timeout of a single execution. If it is triggered the associated input file is marked as 'hanging'. In seconds, 0 means unlimited *(default: 0)*
fr: Timeout d'une seule exécution. S'il est activé l'entrée est marquée comme 'hanging'. En secondes, 0 signifie illimité *(défaut: 0)*

source: Number of execution iterations. 0 means unlimited *(default: 0)*
fr: Nombre d'itérations d'exécutions. 0 signifie illimité *(défaut: 0)*

source: Overall timeout of the exploration in seconds. 0 means unlimited *(default: 0)*
fr: Timeout global de l'exploration en secondes. 0 signifie illimité *(défaut: 0)*

source: Load a configuration from a file to a new instance of Config
fr: Charge une configuration d'un fichier en une instance de Config

source: The path name
fr: Chemin

source: Returns
fr: Renvoie

source: A fresh instance of Config
fr: Nouvelle instance de Config

source: Load a configuration from a json input to a new instance of Config
fr: Charge une configuration à partir d'un fichier JSON en une nouvelle instance de Config

source: The JSON text
fr: Le texte JSON

source: Pipe the program stderr to Python's stderr *(default: False)*
fr: Pipe le 'stderr' du programme dans celui de Python *(défaut: False)*

source: Pipe the program stdout to Python's stdout. *(default: False)*
fr: Pipe le 'stdout' du programme dans celui de Python *(défaut: False)*

source: Concrete program argument as given on the command line.
fr: Arguments à donner en ``argv`` du programme.

source: Whether to emulate sleeps routine or not *(default: False)*
fr: Soit émuler la routine sleep *(avec un vrai sleep) ou non *(défaut: False)*

source: Whether or not to stop the emulation when hitting a external call to a function that is not supported.
fr: Soit sauter par dessus une fonction non supportées ou bien arrêter l'exécution.

source: Limit of SMT queries to perform for a single execution *(default: 1200)*
fr: Limite de requêtes SMT à effectuer pour une seule exécution *(défaut: 1200)*

source: Timeout for a single SMT query in milliseconds *(default: 10)*
fr: Timeout pour une seule requête SMT en milliseconds *(defaut: 10)*

source: Symbolize parameters given on the command line. They are then injected on the libc_start_main function call. *(default: False)*
fr: Symbolise les paramètres sur la ligne de commande (``argv``). Ils sont alors injectés lors de l'appel à ``libc_start_main``. *(défaut: False)*

source: Symbolize reads on ``stdin``. Thus the content of a buffer read in the file descriptor 0 will be symbolized. *(default: False)*
fr: Symbolise les lectures sur ``stdin``. Le contenu du buffer lu issu du *file descriptor* 0 sera symbolisé. *(défaut: False)*

source: At the moment it is incompatible with :py:obj:`tritondse.Config.symbolize_argv` as a single symbolization point is supported at the moment
fr: Pour le moment c'est incompatible avec :py:obj:`tritondse.Config.symbolize_argv` car un seul point d'injection d'une entrée est supporté

source: Number of instructions to execute before switching to the next thread. At the moment all threads are scheduled in a round-robin manner *(default: 200)*
fr: Nombre d'instructions à exécuter avant de programmer un nouveau thread pour exécution. Pour le moment les threads sont programmés de manière cyclique avec un algorithme de round-robin *(défaut: 200)*.

source: Time increment coefficient at each instruction to provide a deterministic behavior when calling time functions (e.g gettimeofday(), clock_gettime(), ...). For example, if 0.0001 is defined, each instruction will increment the time representation of the execution by 100us. *(default: 0.00001)*
fr: Coefficient d'incrémentation du temps pour chaque instruction exécutée. Cela permet d'obtenir un comportement déterministe lors d'un appel à une fonction tel que ``gettimeofday()``, etc. Par exemple, si 0.0001 est défini, chaque instruction exécutée va incrémenter la représentation de l'écoulement du temps de 100us. *(défaut: 0.00001)*

source: Save the current configuration to a file
fr: Sauvegarde la configuration courante dans le fichier

source: Convert the current configuration to a json output
fr: Converti la configuration en JSON

source: JSON text
fr: texte JSON

source: Workspace directory to use. *(default: 'workspace')*
fr: Dossier de workspace à utiliser *(défaut: 'workspace')*
