Repository: quarkslab/tritondse
Catalog: doc/locale/*/LC_MESSAGES/api/explorator.po
Languages: fr

source: Symbolic Exploration. This class is in charge of iterating executions with the different seeds available in the workspace and generated along the way.
fr: Exploration Symbolique. Cette classe est en charge d'itérer les exécutions avec les différentes graines disponibles dans l'espace de travail et générées au fil de l'exécution.

source: Add the given bytes or Seed object as input for the exploration.
fr: Ajoute les octets de la graine ou l'objet Seed comme entrée de l'exploration.

source: Parameters
fr: Paramètres

source: input seed to add in the pending inputs to process
fr: graine d'entrée à ajouter en queue des entrées à exécuter

source: CallbackManager global instance that will be transmitted to all :py:obj:`SymbolicExecutor`.
fr: Instance globale de CallbackManager qui va être transmise à tous les :py:obj:`SymbolicExecutor`.

source: Return type
fr: Type de retour

source: Configuration file
fr: Fichier de configuration

source: GlobalCoverage object holding information about the global coverage. *(not really meant to be manipulated by the user)*
fr: Object GlobalCoverage contenant toutes les informations concernant la couverture globale. *(cet objet ne doit pas être manipulé par l'utilisateur)*

source: last symbolic executor executed
fr: dernier exécuteur symbolique exécuté

source: Get the number of execution performed.
fr: Renvoi le nombre d'exécutions effectuées

source: Returns
fr: Renvoie

source: number of execution performed
fr: nombre d'exécutions effectuées

source: Start the symbolic exploration. That function holds until the exploration is interrupted or finished.
fr: Commence l'exploration symbolique. Cette fonction ne rend la main que lorsqu'elle est interrompue ou bien que l'exploration termine.

source: the status of the exploration
fr: statut de l'exploration

source: Program being analyzed
fr: Programme en cours d'analyse

source: Manager of seed, holding all seeds related data and various statistics
fr: Objet manager de graines, contenant toutes les graines et les informations associées;

source: status of the execution
fr: statut de l'exécution

source: Perform a single exploration step. That means it execute a single :py:obj:`SymbolicExecutor`. Then it gives the hand back to the user.
fr: Effectue une seule étape d'exploration. Cela exécute une seule instance de :py:obj:`SymbolicExecutor`. La main est ensuite rendue à l'utilisateur.

source: Interrupt the exploration
fr: Interrompt l'exécution

source: workspace object
fr: objet d'espace de travail

source: Enum representing the current state of the exploration
fr: Enum qui représente l'état courant de l'exploration

source: Seed Manager. This class is in charge of providing the next seed to execute by prioritizing them. It also holds various sets of pending seeds, corpus, crashes etc and manages them in the workspace.
fr: Manager de Graines. Cette classe a en charge de fournir la prochaine graine à exécuter en priorisant la plus adaptée. Elle content aussi différents ensemble de graines, corpus, crashes et manage les fichiers associés dans l'espace de travail.

source: It contains basically 2 types of seeds which are:
fr: Contient 2 types de graines qui sont:

source: pending seeds (kept in the seed scheduler). These are the seeds that might be selected to be run
fr: graines en attente *(conservées dans le scheduler)*. Ce sont les graines susceptibles d'être choisies afin d'être exécutées

source: seed consumed (corpus, crash, hangs) which are seeds not meant to be re-executed as they cannot lead to new paths, all candidate paths are UNSAT etc.
fr: graines consumée (corpus, crash, hangs), qui n'ont pas vocation à être ré-exécutées car elles ont été entièrement traitées.

source: global coverage object. The instance will be updated by the seed manager
fr: objet de coverage global. Cet objet sera mis à jour pour le manager

source: workspace instance object.
fr: instance de workspace

source: maximum number of queries for a given execution
fr: nombre maximum de requêtes pour une exécution donnée

source: seed scheduler object to use as scheduling strategy
fr: scheduler de graines à utiliser comme stratégie d'ordonnancement des entrées

source: Add the given seed in the manager. The function uses its type to know where to add the seed.
fr: Ajoute la graine dans le manager. Cette fonction utilise le type pour savoir où l'ajouter de manière définitive.

source: seed to add
fr: graine à ajouter

source: Add a seed to to appropriate internal queue depending on its status. If it is new it is added in pending seed, if OK, HANG or CRASH it the appropriate set. **Note that the seed is not written in the workspace**
fr: Ajoute la graine dans la queue interne appropriée en fonction de son statut. Si elle est nouvelle, elle est mise dans la queue en attente. Si elle est OK, HANG ou CRASH elle va dans le set idoine. **La graine n'est pas écrite dans le workspace**

source: Seed to add in an internal queue
fr: Graine à ajouter dans le manager

source: Send a seed in the corpus. As such, the seed is not meant to be used anymore (for finding new seeds).
fr: Envoie une graine dans le corpus. De cette manière la graine n'est plus utilisée pour des exécutions ultérieures.

source: optional status to assign the seed
fr: status optionnel à assigner à la graine

source: Drop a seed that is not of interest anymore. The function thus switch its status to ``OK_DONE`` and move it in the corpus. *(the seed is not removed from the corpus)*
fr: Jette une graine qui n'est plus d'aucun intérêt. La fonction la passe en OK_DONE et la déplace dans le corpus final *(la graine n'est pas supprimée du corpus)*.

source: seed object to drop
fr: object Seed à jeter

source: Check if a seed is a new one (not into corpus, crash and hangs)
fr: Vérifie si une graine est nouvelle, c'est à dire dans aucun des sets ni aucune queue en attente.

source: The seed to test
fr: La graine à tester

source: True if the seed is a new one
fr: Vrai si la graine est nouvelle

source: That function does not check that the seed is not in the pending seeds queue
fr: Cette fonction ne vérifie pas que la graine n'est pas dans les graines en attente.

source: Get the next seed to be executed by querying it in the seed scheduler.
fr: Récupère la prochaine graine à exécuter en appelant le 'scheduler'.

source: Seed to execute from the pending seeds
fr: Graine à exécuter venant du sheduler.

source: Function called after each execution. It updates the global code coverage object, and tries to generate new paths through SMT in accordance with the seed scheduling strategy.
fr: Fonction appelée après chaque exécution. Elle met à jour la couverture globale, et essaye de générer de nouveaux chemins par SMT *(en accord avec la stratégie de scheduling)*.

source: The current execution
fr: L'exécution courante

source: The seed of the execution
fr: La graine de l'exécution

source: Whether or not to solve constraint to find new paths
fr: Oui ou non résoudre les contraintes pour trouver de nouveaux chemins

source: Function called at the end of exploration. It perform some stats printing, but would also perform any clean up tasks. *(not meant to be called by the user)*
fr: Fonction appelée à la fin de l'exploration. Elle effectue des statistiques mais effectue aussi éventuellement des tâches de nettoyage. *(ne doit pas être appelée par l'utilisateur)*

source: Checks whether or not there is still pending seeds to process.
fr: Vérifie s'il reste des graines en attentes à exécuter.

source: True if seeds are still pending
fr: Vrai si des graines sont en attentes
