Repository: quarkslab/tritondse
Catalog: doc/locale/*/LC_MESSAGES/api/process.po
Languages: fr

source: No data is stored, all operations are performed on the TritonContext:
fr: Aucune données ne sont stockées, toutes les opérations sont effectuées sur le TritonContext.

source: The user is not meant to instanciate it manually, and must use it through :py:obj:`ProcessState`.
fr: L'utilisateur n'est pas censé instancier l'objet manuellement. Il doit être utilisé via :py:obj:`ProcessState`.

source: The value of the base pointer register
fr: La valeur du 'base pointer'

source: The value of the program counter (RIP for x86, PC for ARM ..)
fr: La valeur du pointeur d'instruction (RIP pour x86, PC pour ARM..)

source: The value of the stack pointer register
fr: La valeur du pointeur de pile

source: Custom tiny heap allocator. Used by built-ins routines like malloc/free. This allocation manager also provides an API enabling checking whether a pointer is allocated freed etc.
fr: Petit allocateur sur le tas. Utilisé par les fonctions 'built-in' comme malloc ou free. Ce manager fournit aussi les APIs pour vérifier si un pointeur est alloué ou libéré.

source: This allocator is very simple and does not perform any coalescing of freed memory areas. Thus it may not correctly model the behavior of libc allocator.
fr: Cet allocateur est très simple et n'effectue aucune unification des 'chunks' libérés. Il ne modélise pas de manière précise le comportement de la libc.

source: Class constructor. Takes heap bounds as parameter.
fr: Constructeur. Prend le tas comme paramètre.

source: Where the heap area can start
fr: Où le tas démarre

source: Where the heap area must be end
fr: Où le tas termine

source: Performs an allocation of the given byte size.
fr: Effectue une allocation de la taille donnée

source: Byte size to allocate
fr: taille en octets à allouer

source: if not memory is available
fr: si aucune mémoire n'est pas disponible

source: The pointer address allocated
fr: L'adresse du pointeur alloué

source: Heap current offset address
fr: Adresse courante du tas

source: Ending address of the heap
fr: Adresse de fin du tas

source: Free the given memory chunk.
fr: Libère le pointeur mémoire donné

source: Address to free
fr: Adresse à libérer

source: if the pointer has already been freed or if it has never been allocated
fr: si le pointeur a déjà été libéré ou s'il n'a jamais été alloué

source: Check whether a given address has been allocated
fr: Vérifie si l'adresse a été allouée ou non

source: True if pointer points to an allocated memory region
fr: Vrai si le pointeur, pointe sur une adresse allouée

source: Check whether a given pointer has recently been freed.
fr: Vérifie si le pointeur a été récemment libéré ou non

source: True if pointer has been freed, False otherwise
fr: Vrai si le pointeur a été libéré, faux sinon

source: Starting address of the heap
fr: Adresse de début du tas

source: Class used to represent an heap allocator exception. This exception can be raised in the following conditions:
fr: Classe utilisée pour représenter une exception liée au tas. Cette exception peut être levée dans les conditions suivantes:

source: trying to allocate data which overflow heap size
fr: en essayant d'allouer des données qui débordent du tas

source: trying to free a pointer already freed
fr: en essayant de libérer un pointeur déjà libéré

source: trying to free a non-allocated pointer
fr: en essayant de libérer un pointeur non-alloué

source: Thread data structure holding all information related to it. Purposely used to save registers and to restore them in a TritonContext.
fr: Structure représentant un thread et contenant différentes informations associées. Utilisée pour sauvegarder et restaurer les valeurs de registres dans un contexte triton.

source: thread id
fr: identifiant du thread

source: Cancel a join operation.
fr: Annule un opération de join

source: Returns whether the thread is killed or not
fr: Renvoie si le thread est mort ou non

source: boolean indicating if the thread is dead or not
fr: booléen indiquant si le thread est mort ou non

source: Returns whether or not it is the main thread (namely its id is 0)
fr: Renvoi si le thread est le principal (cad il a l'id 0)

source: bool
fr: booléen

source: Return if the thread is properly running or not.
fr: Renvoi si le thread est en train de s'exécuter ou non

source: True if the thread is running
fr: Vrai si le thread s'exécute

source: boolean on whether it waits for another thread
fr: vrai si le thread en attend un autre

source: Put the thread in a join state where waits for another thread.
fr: Met le thread dans un état de "join" d'un autre thread

source: id of the thread to join
fr: identifiant du thread à 'join'

source: Kill the current thread. Called when exiting the thread.
fr: Tue le thread courant. Appelé quand le thread se termine.

source: Restore a thread state in the given TritonContext
fr: Restaure l'état du thread dans le contexte triton donné

source: context in which to restor the current thread state
fr: Contexte dans lequel restaurer l'état du thread

source: Save the current thread state from the current execution. That implies keeping a reference on symbolic and concrete registers.
fr: Sauvegarde l'état courant dans l'état du thread. Cela implique de garder une référence sur les registres concrets et symboliques.

source: current TritonContext to save
fr: TritonContext courant à sauvegarder
