Repository: quarkslab/tritondse
Catalog: doc/locale/*/LC_MESSAGES/api/process.po
Languages: fr

source: Current process state. This class keeps all the runtime related to a running process, namely current, instruction, thread, memory maps, file descriptors etc. It also wraps Triton execution and thus hold its context. At the top of this, it provides a user-friendly API to access data in both the concrete and symbolic state of Triton.
fr: Process courant. Cette classe conserve tous les données liées à l'exécution du process comme l'instruction courante, le thread, le mapping mémoire, les descripteurs de fichiers etc. Elle encapsule aussi le contexte Triton au dessus duquel, elle fournie une API simple d'utilisation pour accéder aux données de l'état concret et symbolique.

source: Parameters
fr: Paramètres

source: Time coefficient to represent execution time of an instruction see: :py:attr:`tritondse.Config.time_inc_coefficient`
fr: Coefficient d'accroissement du temps. Dis autrement, temps d'exécution de chaque instructions voir :py:attr:`tritondse.Config.time_inc_coefficient`

source: Architecture of the current process state
fr: Architecture du process courant

source: Return type
fr: Type de retour

source: Return the appropriate base pointer register according to the arch.
fr: Renvoie le registre de 'base pointer' selon l'architecture

source: Concretize the given function parameter following the calling convention of the architecture.
fr: Concrétise le ième paramètre de la fonction *(en respectant la convention d'appel)*

source: Argument index
fr: Index de l'argument

source: Concretize the given range of memory with its current value.
fr: Concrétise l'intervalle mémoire donnée avec sa valeur dans l'état concret

source: Address to concretize
fr: Adresse à concrétiser

source: Size of the memory buffer to concretize
fr: Taille du buffer mémoire à concrétiser

source: Concretize the given memory with its current concrete value. **This operation is sound** and allows restraining the memory value to its constant value.
fr: Concrétise la mémoire donnée avec sa valeur concrète courante. **Cette opération est correcte et permet de restreindre l'emplacement mémoire avec ça valeur constante.**

source: Size of the integer to concretize
fr: Taille de l'entier à concrétiser

source: Concretize the given register with its current concrete value. **This operation is sound** as it will also add a path constraint to enforce that the symbolic register value is equal to its concrete value.
fr: Concrétise le registre donné avec sa valeur courante dans l'état concret. **Cette opération est correcte, car elle va aussi ajouter une contrainte dans le prédicat de chemin pour indiquer que la valeur symbolique est égale à la valeur concrète.

source: Register identifier (str or Register)
fr: Identifiant de registre (ou string)

source: CpuState holding concrete values of registers *(initialized when calling load_program)*
fr: CpuState conserve les valeurs concrètes des registres *(initialisé lors de l'appel à :meth:`load_program`

source: The current instruction being executed. *(None if not set yet)*
fr: L'instruction courante exécutée *(None si pas positionner)*

source: Gives the current thread selected :return: current thread :rtype: ThreadContext
fr: Donne le thread actuel en train d'être exécuté

source: Fetch the instruction at the given address. If no address is specified the current program counter one is used.
fr: Récupère un objet Instruction a l'adresse donnée. Si aucune adresse n'est spécifiée le pointeur d'instruction est utilisé.

source: Returns
fr: Renvoie

source: instruction disassembled
fr: instruction désassemblée

source: Return the symbolic expression associated with the given ith parameter.
fr: Renvoie l'expression symbolique associée au paramètre demandé.

source: Ith function parameter
fr: Le ième paramètre de fonction

source: Symbolic expression associated
fr: Expression symbolique associée

source: Get the integer value of parameters following the call convention. The value originate either from a register or the stack depending on the ith argument requested.
fr: Récupère la valeur entière de l'argument en suivant la convention d'appel. La valeur provient donc soit d'un registre soit de la pile.

source: Ith argument of the function
fr: ième argument de la fonction

source: integer value of the parameter
fr: valeur entière du paramètre

source: Given a symbolic expression and a model, returns the valuation of all variables involved in the expression.
fr: À partir d'une expression symbolique et d'un modèle, renvoie la valuation de chaque variables impliquée dans le calcul de l'expression.

source: Model generated by the solver
fr: Modèle généré par le solveur

source: dictionnary of symbolic variables and their associated value (as int)
fr: dictionnaire de variables symboliques et leurs valeur associée (entier)

source: Read the format string at ``fmt_addr``. For each format item which are strings, dereference that associated string and replaces it in ``args``.
fr: Lit la chaine de format à ``fmt_addr``. Pour chaque entrées qui sont des chaînes, déréference la chaîne associée et la remplace dans ``args``.

source: Parameters associated with the format string
fr: Paramètres associés à la chaîne de format

source: Returns a formatted string in Python format from a format string located in memory at ``addr``.
fr: Renvoie une chaîne de format Python, à partir de la chaîne de format C située à ``addr``.

source: Get both the concrete argument value along with its symbolic expression.
fr: Récupère la valeur concrète et la valeur symbolique de l'argument sous forme de tuple.

source: Tuple containing concrete value and symbolic expression
fr: Tuple contenant la valeur concrète et la valeur symbolique de l'argument

source: Read a string in process memory at the given address
fr: Lit une chaîne de caractères en mémoire à l'adresse donnée

source: The memory read is unbounded. Thus the memory is iterated up until finding a 0x0.
fr: La lecture est non-bornée. La mémoire est donc lues jusqu'à trouver un 0.

source: the string read in memory
fr: la string lues en mémoire

source: Get the list of all path constraints set in the Triton context.
fr: Récupère la liste des contraintes de chemin

source: list of constraints
fr: liste des contraintes

source: Returns the value at the ith position further in the stack
fr: Renvoie la valeur à la ième position plus loin dans la pile

source: The index position from the top of the stack
fr: l'index de la position depuis le haut de la pile

source: the value got
fr: La valeur obtenue

source: Read a string for which address is a function parameter. The function first get the argument value, and then dereference the string located at that address.
fr: Lit une chaîne de caractères donnée en paramètre d'une fonction. Cette fonction est un sucre syntaxique pour ``get_argument_value`` et ``read_memory_string``.

source: argument index
fr: index de l'argument

source: memory string
fr: string en mémoire

source: Return a new unique file descriptor. Used by routines yielding new file descriptors.
fr: Renvoie un nouveau descripteur de fichier unique. Utilisé par les routines retournant de nouveaux descripteurs.

source: new file descriptor identifier
fr: nouvel identifiant de descripteur de fichier

source: Initialize the context with the given architecture
fr: Initialise le contexte avec l'architecture donnée

source: Protecting that function
fr: Protéger cette fonction

source: The architecture to initialize
fr: L'architecture à initialiser

source: Check if the the current instruction is corresponding to an 'halt' instruction in the target architecture.
fr: Vérifie si l'instruction courante correspond bien à un 'halt' dans l'architecture cible.

source: Return true if on halt instruction architecture independent
fr: Renvoie vrai si l'instruction une instruction d'arrêt 'halt'

source: Check whether a given address is pointing in the heap area.
fr: Vérifie si l'adresse donnée pointe sur le tas.

source: Address to check
fr: Adresse à vérifier

source: True if pointer points to the heap area *(allocated or not)*.
fr: Vrai si le pointeur, adresse le tas *(que l'adresse soit allouée ou non)*

source: Returns whether the given range of addresses has previously been written or not.
fr: Renvoie si l'interval d'adresse donné à déjà été écrit par le passé ou non.

source: The pointer to check
fr: Le pointeur à vérifier

source: True if all addresses have been defined
fr: Vrai si toutes les adresses ont déjà été définies

source: Iterate the symbolic memory and returns whether or not at least one byte of the buffer is symbolic
fr: Itère l'intervalle mémoire donnée et renvoie vrai si au moins un octet est symbolique.

source: Memory address
fr: Adresse mémoire

source: size of the memory range to check
fr: taille de l'intervalle mémoire à vérifier

source: True if at least one byte of the memory is symbolic, false otherwise
fr: Vrai si au moins un octet de mémoire est symbolique, Faux sinon

source: Check whether or not the register is symbolic.
fr: Vérifie si oui ou non le registre est symbolique.

source: register string, or Register object
fr: objet Registre ou nom sous forme de string

source: Check whether a given address is pointing in stack area.
fr: Vérifie si l'adresse mémoire pointe sur la pile.

source: True if pointer points to the stack area (allocated or not).
fr: Vrai si le pointeur adresse une zone de la pile

source: Check if a given address is mapped into memory maps
fr: Vérifie si l'adresse donnée est mappée en mémoire *(contenue dans les memory maps)*

source: A padding to add at the end of segment if necessary
fr: Un padding à ajouter à la fin d'un segment (si nécessaire)

source: True if ptr is mapped otherwise returns False
fr: Vrai si ``ptr`` est mappé, faux sinon

source: Return the last PathConstraint object added in the path predicate. Should be called after :py:meth:`is_path_predicate_updated`.
fr: Renvoie le dernier objet ``PathConstraint`` ajouté au prédicat de chemin. Doit être appelée après :py:meth:`is_path_predicate_updated`.

source: Raises
fr: Exception

source: if the path predicate is empty
fr: si le prédicat de chemin est vide

source: the path constraint object as returned by Triton
fr: l'entrée du prédicat de chemin tel que renvoyé par Triton

source: Load the given program in the process state memory. It sets the program counter to the entry point and load all segments in the triton context.
fr: Charge le programme donnée dans la mémoire du processus. Il configure le pointeur d'instruction sur le point d'entré, et charge tous les segments dans le contexte Triton.

source: Program to load in the process memory
fr: Programme à charger dans la mémoire du processus

source: Base address where to load the program (if PIE)
fr: adresse de base où charger le programme *(si PIE)*

source: Value -1 according to the architecture size (32 or 64 bits)
fr: Valeur -1 en fonction de la taille d'un entier dans l'architecture cible (32 ou 64 bits)

source: -1 as an unsigned Python integer
fr: -1 comme entier non-signé Python

source: Get the size of the path predicate (conjonction of all branches and additionnals constraints added)
fr: Récupère la taille du prédicat de chemin (conjonction de toutes les contraintes de branches et celles ajoutées manuellement)

source: Pop a stack value, and the re-increment the stack pointer value. This operation is fully concrete.
fr: Pop une valeur concrète de la pile. *(ce qui implique l'incrémentation du pointeur de pile)*. Cette opération est complètement concrète.

source: int
fr: entier

source: Process the given triton instruction on this process state.
fr: Traite l'instruction donnée en argument *(et fait tous les mises à jour sur l'état concret et symbolique)*

source: Triton Instruction object
fr: Object Instruction Triton

source: True if the processing of the instruction succeeded (False otherwise)
fr: Vrai si le traitement de l'instruction réussi (faux sinon)

source: Return the appropriate pc register according to the arch.
fr: Renvoie le registre de pointeur d'instruction (en fonction de l'architecture)

source: Size of a pointer in bits
fr: Taille d'un pointeur en bits

source: Size of a pointer in bytes
fr: Taille d'un pointeur en octets

source: Thin wrapper on the triton context underneath to add a path constraint.
fr: Léger wrapper pour l'ajout d'une contrainte dans le prédicat de chemin du context triton.

source: Constraint expression to add
fr: Expression de la contrainte à ajouter

source: Push a stack value. It then decreement the stack pointer value.
fr: Pousse la valeur sur la pile. *(ce qui décrémente le pointeur de pile)*.

source: The value to push
fr: La valeur à pousser

source: Read in the process memory ``size`` amount of bytes at ``addr``. Data read is returned as bytes.
fr: Lit ``size`` octets dans la mémoire du processus à l'adresse ``addr``. Les données sont renvoyées sous forme d'octets.

source: Address at which to read data
fr: adresse à laquelle lire les données

source: Number of bytes to read
fr: Nombre d'octets à lire

source: Data read
fr: Données lues

source: Read in the process memory a **little-endian** integer of the ``size`` at ``addr``.
fr: Lit un entier en **little-endian** de la taille ``size`` à l'adresse ``addr``.

source: Integer value read
fr: Valeur entière lue

source: Read in the process memory a little-endian integer of size :py:attr:`tritondse.ProcessState.ptr_size`
fr: Lis un entier (little-endian) en mémoire de la taille donnée :py:attr:`tritondse.ProcessState.ptr_size`

source: Read the current concrete value of the given register.
fr: Lit la valeur d'un registre donné

source: string of the register or Register object
fr: identifiant du registre (ou nom)

source: Integer value
fr: valeur entière

source: Thin wrapper to retrieve the symbolic expression of a single bytes in memory.
fr: Léger 'wrapper' pour récupérer l'expression symbolique d'un octet en mémoire.

source: Symbolic Expression associated with the memory
fr: Expression symbolique associée à la mémoire

source: Return a new Symbolic Expression representing the whole memory range given in parameter. That function should not be used on big memory chunks.
fr: Renvoie une nouvelle expression symbolique représentant l'intervalle mémoire donnés. Cette fonction ne doit pas être utilisée sur de gros intervalles mémoire.

source: memory size in bytes
fr: taille mémoire en octets

source: If the size if not aligned
fr: si la taille n'est pas alignée

source: Get the symbolic expression associated with the given register.
fr: Récupère l'expression symbolique du registre

source: SymbolicExpression of the register as returned by Triton
fr: SymbolicExpression du registre tel que renvoyé par Triton

source: Register the given ``callback`` as triton callback to hook memory/registers read/writes.
fr: Enregistre ``callback`` pour intercepter une lecture/écriture, mémoire/registre.

source: Callback enum type as defined by Triton
fr: Type de callback tel que définit par Triton

source: routines to call on the given event
fr: fonction à appeler au déclenchement de l'évènement

source: All registers according to the current architecture defined. The object returned is the TritonContext.register object.
fr: Tous les registres de l'architecture courante. C'est l'objet Triton tel que obtenu avec TritonContext.register.

source: Return the appropriate return register according to the arch
fr: Renvoie le registre de 'retour' tel que définit par l'architecture

source: Set the timeout for all subsequent queries.
fr: Configure le timeout de toutes les requêtes SMT effectuée ensuite.

source: timeout in milliseconds
fr: timeout en millisecondes

source: Set the given mode in the TritonContext.
fr: Positionne le mode dans le TritonContext

source: mode to set in triton context
fr: mode à appliquer au contexte

source: value to set (default True)
fr: valeur à positionner (True par défaut)

source: Solve the given constraint one the current symbolic state and returns both a Solver status and a model. If not SAT the model returned is empty. Argument ``with_pp`` enables checking the constraint taking in account the path predicate.
fr: Résoud la contrainte donnée sur l'état symbolique et renvoie le satisfiabilité et un modèle. Si la formule n'est pas SAT le modèle renvoyé est vide. L'argument ``with_pp`` permet de vérifier la contrainte en prenant ou non en compte le prédicat de chemin.

source: AstNode or list of AstNodes constraints to solve
fr: AstNode ou liste de AstNodes à résoudre

source: whether to take in account path predicate
fr: prendre le prédicat de chemin en compte ou non

source: tuple of status and model
fr: tuple du status et modèle

source: Helper function that solve a constraint forcing not to use the path predicate.
fr: Fonction d'aide pour résoudre une contrainte en forçant à ne pas utiliser le prédicat de chemin.

source: Solving a query without the path predicate gives theoretically unsound results.
fr: Résoud une requête sans le prédicat de chemin. Le résultat peut être incorrect !

source: AstNode constraint to solve
fr: AstNode contrainte à résoudre

source: Create a new thread in the process state. Parameters are the new program counter and a pointer to arguments to provide the thread.
fr: Créé un nouveau thread dans le process state. Les paramètres sont le nouveau pointeur d'instruction et un pointeur vers les arguments à fournir au thread.

source: new program counter (function to execution)
fr: nouveau pointeur d'instruction (fonction à exécuter)

source: thread context newly created
fr: ThreadContext créé

source: Return the appropriate stack pointer register according to the arch.
fr: Renvoie l'identifiant du registre pointeur de pile tel que définit dans la pile.

source: Change the current thread to the one given in parameter. Thus save the current context, and restore the one of the thread given in parameter. It also resets the counter of the thread restored. If the current_thread is dead, it will also remove it !
fr: Change le thread couramment exécuté par un autre. Cela déclenche la sauvegarde du contexte et la restauration de celui donné en paramètre. Si le thread courant est mort, celui-ci sera supprimé.

source: thread to restore ThreadContext
fr: ThreadContext à restaurer

source: True if the switch worked fine
fr: Vrai si le changement de contexte s'est bien déroulé

source: Symbolize the given memory cell. Returns the associated SymbolicVariable
fr: Symbolise la cellule mémoire donné. Renvoir l'objet SymbolicVariable nouvellement créé.

source: alias to give the variable
fr: alias à donner à la variable

source: newly created symbolic variable
fr: SymbolicVariable créée

source: Symbolize a range of memory addresses. Can optionally provide an alias prefix.
fr: Symbolise un interval d'adresses mémoires. Peux optionnellement fournir un prefix en alias.

source: prefix name to give the variable
fr: préfix de nom à donner à la variable

source: list of Symbolic variables created
fr: liste de SymbolicVariable créées

source: Symbolize the given register. This a proxy for the symbolizeRegister Triton function.
fr: Symbolise le register donné. Fonction proxy vers la fonction Triton symbolizeRegister.

source: alias name to give to the symbolic variable
fr: alias à donner à la variable

source: Triton Symbolic variable created
fr: SymbolicVariable créée

source: Gives a list of all threads currently active :return:
fr: Donne une list de tous les threads actifs.

source: Write a single byte in the process memory. Can be provided as a byte or integer. Integer value should fit in a byte.
fr: Écrit un seul octet dans la mémoire du processus. Peut-être fourni comme un byte ou un entier Python (qui doit tenir dans un octet).

source: bytes data to write
fr: octets à écrire

source: Write multiple bytes in the process memory. Size is automatically deduced with data size.
fr: Écrit plusieurs octets dans la mémoire du processus. La taille est automatiquement déduite à partir de la taille des données.

source: Write in the process memory the given integer value of the given size at a specific address.
fr: Écrit une valeur entière de la taille donnée en mémoire.

source: data to write represented as an integer
fr: donnée à écrire sous forme d'entier

source: Adding a parameter to specify endianess if needed
fr: Ajouter un paramètre pour spécifier l'endianness si besoin

source: Similar to :py:meth:`write_memory_int` but the size is automatically adjusted to be ``ptr_size``.
fr: Similaire à :py:meth:`write_memory_int` mais la taille est automatiquement ajustée pour être celle d'un pointeur (``ptr_size``).

source: address where to write data
fr: adresse où écrire les données

source: pointer value to write
fr: valeur du pointeur à écrire

source: integer value to assign in the register
fr: valeur à mettre dans le registre

source: Set a single bytes symbolic at the given address
fr: Écrit un seul octet en mémoire à l'adresse donnée

source: byte expression to assign (`AstNode <https://triton.quarkslab.com/documentation/doxygen/py_AstNode_page.html>`_ or `SymbolicExpression <https://triton.quarkslab.com/documentation/doxygen/py_SymbolicExpression_page.html>`_)
fr: expression de l'octet à écrire (`AstNode <https://triton.quarkslab.com/documentation/doxygen/py_AstNode_page.html>`_ ou `SymbolicExpression <https://triton.quarkslab.com/documentation/doxygen/py_SymbolicExpression_page.html>`_)

source: Assign the given symbolic expression representing an integer to the given address. That function should not be used on big memory chunks.
fr: Assigne l'expression symbolique d'un entier à l'adresse donnée en mémoire. Cette fonction ne doit pas être utilisée sur de gros intervalles mémoire.

source: expression to assign (`AstNode <https://triton.quarkslab.com/documentation/doxygen/py_AstNode_page.html>`_ or `SymbolicExpression <https://triton.quarkslab.com/documentation/doxygen/py_SymbolicExpression_page.html>`_)
fr: expression à assigner (`AstNode <https://triton.quarkslab.com/documentation/doxygen/py_AstNode_page.html>`_ ou `SymbolicExpression <https://triton.quarkslab.com/documentation/doxygen/py_SymbolicExpression_page.html>`_)

source: if the size if not aligned
fr: si la taille n'est pas alignée

source: Assign the given symbolic expression to the register. The given expression can either be a SMT AST node or directly an Expression (SymbolicExpression).
fr: Assigne l'expression symbolique au registre.

source: register identifier (str or Register)
fr: Identifiant du registre ou nom (str).

source: Comment to add on the symbolic expression created
fr: Commentaire à ajouter à l'expression symbolique créée

source: Thin wrapper on a TritonContext, to allow accessing and modifying registers in a Pythonic way. It also abstract base, stack, and program counter for architecture agnostic operations. This class performs all actions on the TritonContext, and does not hold any information. It is just acting as a proxy
fr: Wrapper autour de TritonContext permettant d'accéder et de modifier très facilement les valeurs de registre de manière 'Pythonic'. Elle abstrait aussi le pointeur de base, pile et instruction pour effectuer les opérations agnostiques de l'architecture. Cette classe effectue toutes les opérations sur le TritonContext directement et ne conserve aucunes valeur interne. *(Il agit seulement comme proxy)*

source: This class adds dynamically attributes corresponding to register. Thus attributes will vary from an architecture to the other.
fr: Cette classe ajoute dynamiquement les attributs correspondant à tous les registres. Ainsi, les attributs varient d'une architecture à l'autre.
