Repository: quarkslab/tritondse
Catalog: doc/locale/*/LC_MESSAGES/api/sanitizers.po
Languages: fr

source: Format String Sanitizer. This probes hooks standard libc functions like 'printf', 'fprintf', 'sprintf', 'dprintf', 'snprintf' and if one of them is triggered it checks the format string. If the format string is symbolic then it is user controlled. A warning is shown but the execution not interrupted. However the sanitizer tries through SMT to generate format strings with many '%s'. If satisfiable a new input is generated which will then be added to inputs to process. That subsequent input might lead to a crash.
fr: Sanitizer de chaîne de format. Cette probe intercepte les fonctions de la libc telles que 'printf', 'fprintf', 'sprintf', 'dprintf', 'snprintf' et si l'une d'entre elles est appelée la vérification à lieu. Si la chaîne de format est symbolique elle est controllée par l'utilisateur. Un message d'alerte est affiché mais l'exécution n'est pas interrompue. Cependant, le sanitizer essaye de générer par SMT une chaîne de format contenant autant de '%s' que possible. Si la formule est satisfiable un nouvelle entrée est générée et elle sera ensuite ajoutée à la queue. Cet entrée elle, pourra eventuellement mener à un crash.

source: list of callback infos
fr: liste des callbacks à enregistrer

source: Checks that the format string at ``fmt_ptr`` does not contain symbolic bytes. If so shows an alert and tries to generate new inputs with as many '%s' as possible.
fr: Vérifie que la chaîne de format ``fmt_ptr`` ne contient aucun octets symboliques. Dans ce cas, une alerte est montrée et essaye de générer une nouvelle entrée fautive.

source: Parameters
fr: Paramètres

source: symbolic executor
fr: exécuteur symbolique

source: process state
fr: process

source: pointer address to check
fr: adresse du pointeur à vérifier

source: additionnal infos given by the callbacks on routines (indicating function address)
fr: informations additionnelles fournies par la routine (indique l'adresse de la fonction)

source: Returns
fr: Renvoi

source: True if the bug is present
fr: Vrai si le bug est présent

source: Integer Overflow Sanitizer. This probe checks on every instructions that the overflow flag is not set. If so mark the input as a crashing input. If not, but the value is symbolic, via SMT solving to make it to be set (and thus to overflow). If possible generates a new input to be executed.
fr: Sanitizer de débordement d'entiers. Cette probe vérifie sur toutes les instructions que le drapeau d'overflow n'est pas positionné. Si c'est le cas, marque l'entrée comme crash. Sinon, et si la valeur est symbolique, une requête SMT est effectuée pour regarder si un overflow peux avoir lieu. Si c'est le cas génère une nouvelle entrée à exécuter.

source: The entry point of the sanitizer. This function check if a bug is present
fr: Le point d'entré du sanitizer. Cette fonction vérifie si le bug est présent où non.

source: Instruction that has just been executed
fr: Instruction qui vient juste d'être exécutée

source: Null Dereference Sanitizer. Simply checks if any memory read or write is performed at address 0. If so an error is raised.
fr: Sanitizer de déréférencement de pointeur null. Vérifie simplement si toutes lecture ou écriture en mémoire est effectuée à l'adresse 0. Dans ce cas une erreur est levée.

source: Checks that the ``ptr`` given is basically not 0.
fr: Vérifie que ``ptr`` donné n'est pas 0.

source: description string printed in logger if an issue is detected
fr: chaîne de description de l'erreur à afficher en cas de détection.

source: Use-After-Free Sanitizer. It is able to detect UaF and double-free. It works by hooking all memory read/write if it points to the heap in a freed area then the Use-After-Free is detected. It also hooks the free routine to detect double-free.
fr: Sanitizer de Use-After-Free. Il est capable de détecter UaF et double-free. Ca marche en interceptant toutes les lectures/écritures mémoires pointant dans le tas. Si la zone a été libérée alors le UaF est détecté. Ca marche aussi en interceptant la routine free pour la détection de double-free.

source: Checks whether the given ``ptr`` is symptomatic of a Use-After-Free by querying various methods of :py:obj:`tritondse.heap_allocator.HeapAllocator`.
fr: Vérifie si ``ptr`` est symptomatique d'un Use-After-Free en requêtant différentes méthodes de :py:obj:`tritondse.heap_allocator.HeapAllocator`.
