Repository: quarkslab/tritondse
Catalog: doc/locale/*/LC_MESSAGES/api/seeds.po
Languages: fr

source: Seed input. Holds the bytes buffer of the content a status after execution but also some metadata of code portions it is meant to cover.
fr: Graine d'entrée. Contient les octets du contenu, le statut après exécution mais aussi quelques méta données indiquant les portions de code à couvrir.

source: Parameters
fr: Paramètres

source: content of the input. By default is b"" *(and is thus considered as a bootstrap seed)*
fr: contenu de l'entrée. Par défaut c'est b"" *(considéré dans ce cas comme graine de démarrage)*

source: status of the seed if already known
fr: statut de la graine si déjà connue

source: Equality check based on content.
fr: Vérification d'égalité basée sur le contenu de la graine

source: Returns
fr: Renvoie

source: true if content of both seeds are equal
fr: vrai si le contenu des deux graines est égale

source: Seed hash function overriden to base itself on content. That enable storing seed in dictionnaries directly based on their content to discriminate them.
fr: Fonction de hash réécrite pour ce baser sur le contenu de la graine. Permet l'utilisation de graines comme clés de dictionnaire *(discriminée sur le contenu)*

source: Return type
fr: Type de retour

source: Size of the content of the seed.
fr: Taille du contenu de la graine.

source: list of weak references to the object (if defined)
fr: liste de 'weak' références vers l'objet *(si défini)*

source: content of the seed
fr: contenu de la graine

source: Standardized filename based on hash and size. That does not mean the file exists or anything.
fr: Nom de fichier standardisé basé sur son hash et son contenu. *(ça n'implique pas que le fichier existe)*

source: formatted intended filename of the seed
fr: nom de fichier formaté

source: seed path
fr: chemin de la graine

source: status of the seed if any, otherwise :py:obj:`SeedStatus.NEW`
fr: statut de la graine, s'il n'est pas positionné elle est: :py:obj:`SeedStatus.NEW`

source: fresh seed instance
fr: nouvelle instance de graine

source: MD5 hash of the seed content
fr: Hash MD5 du contenu de la graine

source: A bootstrap seed is an empty seed (b""). It will received a specific processing in the engine as its size will be automatically adapted to the size read (in stdin for instance)
fr: Une graine de démarrage est une graine vide (b""). Elle sera traitée différemment car elle sera initialisée avec des zéros et la taille sera adaptée à la taille maximum lues (dans stdin par exemple).

source: true if the seed is a bootstrap seed
fr: vrai si la graine est une graine de démarrage

source: A fresh seed is never been executed. Its is recognizable as it does not contain any coverage objectives.
fr: Une graine est fraîche si elle n'a jamais été exécutée. Elle est reconnaissable car elle ne contient aucun objectifs de couverture.

source: True if the seed has never been executed
fr: vrai si la graine n'a jamais été exécutée

source: Size of the seed content in bytes
fr: Taille du contenu de la graine en octets

source: Status of the seed.
fr: Statut de la graine

source: Seed status enum. Enables giving a status to a seed during its execution. At the end of a :py:obj:`SymbolicExecutor` run one of these status must have set to the seed.
fr: Enum qui représente le statut d'une graine. Le statut est assigné au cours de son exécution. À la fin d'une exécution de :py:obj:`SymbolicExecutor` un statut doit avoir été assigné à la graine.
