Repository: quarkslab/tritondse
Catalog: doc/locale/*/LC_MESSAGES/api/types.po
Languages: fr

source: Common architecture Enum fully compatible with Triton `ARCH <https://triton.quarkslab.com/documentation/doxygen/py_ARCH_page.html>`_
fr: Enum représentant l'architecture compatible avec Triton `ARCH <https://triton.quarkslab.com/documentation/doxygen/py_ARCH_page.html>`_

source: SMT logic formula as returned by Triton (`AstNode <https://triton.quarkslab.com/documentation/doxygen/py_AstNode_page.html>`_)
fr: Formule SMT telle que retournée par Triton (`AstNode <https://triton.quarkslab.com/documentation/doxygen/py_AstNode_page.html>`_)

source: Type representing a edge in the program
fr: Représente une arête dans le programme

source: Symbolic Expression as returned by Triton (`SymbolicExpression <https://triton.quarkslab.com/documentation/doxygen/py_SymbolicExpression_page.html>`_)
fr: Expression Symbolique telle que retournée par Triton (`SymbolicExpression <https://triton.quarkslab.com/documentation/doxygen/py_SymbolicExpression_page.html>`_)

source: Solver `Model <https://triton.quarkslab.com/documentation/doxygen/py_SolverModel_page.html>`_ as returned by Triton
fr: Modèle SMT de solveur `Model <https://triton.quarkslab.com/documentation/doxygen/py_SolverModel_page.html>`_ tel que renvoyé par Triton

source: `PathConstraint <https://triton.quarkslab.com/documentation/doxygen/py_PathConstraint_page.html>`_ object as returned by Triton
fr: `PathConstraint <https://triton.quarkslab.com/documentation/doxygen/py_PathConstraint_page.html>`_ tel que renvoyé par Triton

source: Type representing file either as a file, either as a Path object
fr: Chemin vers un fichier sous forme de string ou d'objet :py:obj:`Path`

source: Register identifier as used by Triton *(not the Register object itself)*
fr: Identifiant de registre tel que utilisé par Triton *(pas l'objet Register lui-même)*

source: Set of registers as used by Triton
fr: Ensemble des registres tel que utilisé par Triton

source: Common Solver Enum fully compatible with Triton ARCH
fr: Enum commun représentation le statut obtenu pour la résolution (valeur compatibles avec Triton ARCH)
