Repository: quarkslab/tritondse
Catalog: doc/locale/*/LC_MESSAGES/api/workspace.po
Languages: fr

source: Workspace
fr: Espace de Travail

source: Class to abstract the file tree of the current exploration workspace. A user willing to save additional files in the workspace is invited to do it from the workspace API as it somehow abstract the exact location of it.
fr: Classe qui abstrait l'arborescence utilisée dans l'espace de travail. Un utilisateur voulant écrire des fichiers additionnels dans le workspace est invité à le faire via l'API et non pas manuellement. Cela permet d'abstraire la localisation exact du dossier.

source: Parameters
fr: Paramètres

source: Root directory of the workspace. Created if not existing
fr: Dossier racine de l'espace de travail. Il est créé s'il n'existe pas

source: Read a metadata file from the workspace on disk. Data is read as a string. If the given file does not exists, None is returned
fr: Lit un fichier de méta données dans l'espace de travail. Les données sont lues comme une string. Si le fichier n'existe pas, None est renvoyé.

source: file name (can also be a path)
fr: nom de fichier *(peux aussi être de type Path)*

source: Returns
fr: Renvoie

source: File content as string if existing
fr: Contenu du fichier sous forme de string s'il existe

source: Return type
fr: Type de retour

source: Get a file path in the workspace directory that the user can write into. Might be called for the user to write on its own the file content.
fr: Récupère un chemin dans l'espace de travail, dans lequel l'utilisateur peut écrire. Peut être appelé par l'utilisateur pour écrire lui-même le contenu du fichier.

source: filename wanted
fr: nom de fichier voulu

source: absolute filepath (regardless of whether it exists or not)
fr: chemin absolu (qu'il existe ou non)

source: Initialize the workspace by creating all required subfolders if not already existing.
fr: Initialise l'espace de travail en créant tous les sous dossiers nécessaires s'ils n'existent pas déjà.

source: if True deletes all files contained in the workspace
fr: si vrai, supprime tous les fichiers contenus dans l'espace de travail

source: Iterate over the corpus files as Seed object.
fr: Itère le contenu du corpus comme objet :py:obj:`Seed`.

source: generator of Seed object
fr: Générateur d'objet :obj:`Seed`

source: Iterate over the crashes files as Seed object.
fr: Itère les crashes comme objet :obj:`Seed`.

source: Iterate over the hang files as Seed object.
fr: Itère les 'hangs' comme objet :obj:`Seed`.

source: Iterate over the worklist files as Seed object. Worklist are all the pending seeds
fr: Itère la queue de graines en attente de traitement.

source: Save a, arbitrary file in the workspace by providing the relative path of the file. If ``override`` is True, erase the previous file if any.
fr: Sauvegarde un fichier arbitraire dans l'espace de travail en fournissant son chemin relatif. Si ``override`` est activé, écrase le précédent fichier s'il en est un.

source: relative path of the file
fr: chemin relatif du fichier

source: content to write
fr: contenu à écrire

source: whether to override or not an existing file
fr: écraser le précédent fichier ou non

source: Save ``content`` in a file ``name`` in the metadata directory. The name should be a file name not a path.
fr: Sauvegarde ``content`` dans le fichier ``name`` dans le sous dossier de méta données. Le nom doit être un nom de fichier pas un chemin.

source: file name
fr: nom de fichier

source: content of the file to write
fr: contenu du fichier à écrire

source: Save the current seed in the workspace directory matching its status.
fr: Sauvegarde la graine courante dans l'espace de travail en fonction de son statut.

source: Seed to save
fr: Graine à enregistrer

source: Move a worklist seed to its final location according to its (new) status. Typically used to move a seed from pending ones to corpus or crash once it is fully consumed.
fr: Déplace un graine initialement située dans la queue jusqu'à son dossier final en fonction de son statut. Typiquement, une graine est déplacée du dossier de graines en attente jusqu'au dossier de corpus final quand celle-ci a entièrement été traitée.

source: seed to move
fr: graine à déplacer
